# GetReferencesWithDividedSurfaces Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..GetReferencesWithDividedSurfaces Method
DividedSurface Class See Also
---
For a given host element get references to all the faces that host a divided surface
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static IList<Reference> GetReferencesWithDividedSurfaces(
	Element host
)
```

Visual Basic
---
```text
Public Shared Function GetReferencesWithDividedSurfaces ( _
	host As Element _
) As IList(Of Reference)
```

Visual C++
---
```text
public:
static IList<Reference^>^ GetReferencesWithDividedSurfaces(
	Element^ host
)
```

# ### Parameters
host
    Type: Autodesk.Revit.DB..::..Element The element that hosts the divided surfaces
# ### Return Value
References that host a divided surface
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace